@lijok thanks! I'm not sure I understand the context you're expecting this to run in. I ran the following:
Case 1:
```
variable environment {
  default = {}
}

provider "aws" {
  region  = "us-west-2"
}

resource aws_lambda_function this {
  function_name = "test-function"
  s3_bucket = "test-bucket"
  s3_key = "test-function.zip"
  handler = "lambda_function.lambda_handler"
  role = "test-role-arn"
  description = "Managed by Terraform"
  runtime = "python3.8"

  dynamic environment {
    for_each = var.environment != {} ? ["1"] : []

    content {
      variables = var.environment
    }
  }
}
```
and got the following output:
```
terraform-v0.12.23 plan  -out tf.plan      
provider.aws.region
  The region where AWS operations will take place. Examples
  are us-east-1, us-west-2, etc.

  Enter a value: us-west-2

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "Managed by Terraform"
      + function_name                  = "test-function"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)                                                                                                                                                 + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)                                                                                                                                                 + reserved_concurrent_executions = -1
      + role                           = "test-role-arn"
      + runtime                        = "python3.8"
      + s3_bucket                      = "test-bucket"
      + s3_key                         = "test-function.zip"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------
```

For the second case, the code is:
```
variable environment {
  default = []
}

provider "aws" {
  region  = "us-west-2"
}

resource aws_lambda_function this {
  function_name = "test-function"
  s3_bucket = "test-bucket"
  s3_key = "test-function.zip"
  handler = "lambda_function.lambda_handler"
  role = "test-role-arn"
  description = "Managed by Terraform"
  runtime = "python3.8"

  dynamic environment {
    #for_each = var.environment != {} ? ["1"] : []
    for_each = var.environment != [] ? ["1"] : []

    content {
      variables = var.environment
    }
  }
}
```
In the second case, my output is:
```
terraform-v0.12.23 plan -out tf.plan

provider.aws.region
  The region where AWS operations will take place. Examples
  are us-east-1, us-west-2, etc.

  Enter a value: us-west-2

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "Managed by Terraform"
      + function_name                  = "test-function"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "test-role-arn"
      + runtime                        = "python3.8"
      + s3_bucket                      = "test-bucket"
      + s3_key                         = "test-function.zip"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
------------------------------------------------------------------------
```
These look the same to me. Are you working on the case where the resource already exists? I think I'm probably just not understanding what you're running - can you please be more explicit?